#define  _CRT_SECURE_NO_WARNINGS
#include <iostream>
#include <conio.h>
#include "windows.h"
#include<math.h>


int main(void) {
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);

	int a, b, c;
	int D, D2, b2;
	int X1, X2;

	printf("|\t Калькулятор для нахождения корней квадратного уровнения            |\n");
	printf("|===========================================================================|\n");
	printf("|                                                                           |\n");
	printf("|\t\t\tax^2+bx+c=0                                         |\n");
	printf("|                                                                           |\n");
	printf("|===========================================================================|\n");
	printf("\n");
	printf("\n");
	printf("Введите число а >");
	scanf("%d", &a);
	printf("\nВведите число b >");
	scanf("%d", &b);
	printf("\nВведите число c >");
	scanf("%d", &c);

	if (a == 0)
	{
		printf("\n-----------------------------------------------------------------------------\n");
		printf("\nВы допустили ошибку!  Переменная а = %d\n", a);
		printf("\n-----------------------------------------------------------------------------\n");

	}
	else {


		/*----------------------*/

		b2 = b * b;

		D = b2 - 4 * a * c;
		if (D <= 0)
		{
			printf("\n-----------------------------------------------------------------------------\n");
			printf("\nОшибка! Вы ввели значения при которых дискриминант равен %d", D);
			printf("\n\n-----------------------------------------------------------------------------\n");

		}
		else {
			D2 = sqrt(D);

			/*----------------------*/

			X1 = ((-b + D2) / (2 * a));
			X2 = ((-b - D2) / (2 * a));
			printf("\n-----------------------------------------------------------------------------\n");
			printf("\nВ результате получилось 2 корня:\n");
			printf("X1= %d", X1);
			printf("\nX2= %d\n", X2);
			printf("\n-----------------------------------------------------------------------------\n");
		}
	}

	_getch();
}
