#include "Print.h"

void Print(mon spis[])
{
	system("cls");

	cout << "----------------------------------------------------------------------" << endl;
	cout << "|                  Проекты поиска внеземных сигналов                 |" << endl;
	cout << "|--------------------------------------------------------------------|" << endl;
	cout << "|Год |Научный              |Диаметр     |Рабочая частота             |" << endl;
	cout << "|    |руководитель         |антенны (м) |частота (МГц)               |" << endl;
	cout << "|----|---------------------|------------|----------------------------|" << endl;

	for (int i = 0; i < N; i++)
	{
		cout << "|" << setw(4) << spis[i].sc << "|" << setw(21) << left <<
			spis[i].name << setw(-21) << "|" << setw(12) << spis[i].size << "|" << setw(28) << spis[i].mhz << "|" << endl;
	}
	cout << "|--------------------------------------------------------------------|" << endl;
	cout << "|Примечание: наблюдались объекты от 2 звезд до нескольких галактик   |" << endl;
	cout << "----------------------------------------------------------------------" << endl;
	cout << endl;
	cout << "\nНажмите клавишу Enter для возврата в меню..." << endl;
	_getch();
	system("cls");


}
