//Программа, обманщик (ПК и Человек. Кто загадает большее число, тот и выиграл. Выигрывает всегда ПК

#include<iostream>
#include<stdio.h>

using namespace std;

int main()
{
	setlocale(LC_ALL, "Rus");
	system("cls");

	printf("\t\t\t\tPC или человек. Кто загадает большее число, тот и выиграл.\n\n");
	printf("=======================================================================================================================\n");
	printf("=======================================================================================================================\n\n");


	int human, pc,result;
	printf("Введите число: ");
	scanf_s("%d",&human);
	system("cls");
	result = human + 27;
	printf("Вы ввели число %d, ПК выбрал число %d. Вы проиграли, попробуйте еще раз!\n\n\n\n", human, result);

	printf("========================================================================================================================\n");
	printf("========================================================================================================================\n");
	printf("========================================================================================================================\n");

	
	












}