#include "fun.h"

MATH::MATH() {    // Заполняем аргументы по умолчанию
	a = 4;
	b = 7;
	c = 3;
	S1 = 0;
	S2 = 0;
}

void MATH::count()   // Функция для подсчета S
{
	S1 = pow(a, 2);
	S2 = b * c;
}

void MATH::show()const {  // Выводим результаты 
	cout << "Cторона квадрата -> ";
	cout << a << endl;
	cout << "Сторона прямоугольника а -> " << b << "\nСторона прямоугольника b -> " << c << endl << endl;
	cout << "Результат программы по нахождению площади фигур: " << endl;
	cout << "S - квадрата = " << S1 << endl;
	cout << "S - прямоугольника = " << S2 << endl;
}


//{
//	int S;
//	int a1 = 2;
//
//	S = pow(a, a1);
//	S = a * b;
//	return S;
//}