//Программа которая считает cколько секунд в текущем году(в 100, в 1000 лет).
//Работа с откладчиком. Значения регулирующих переменных продемонстрировать в откладчике.

#include<iostream>
#include<stdio.h>

using namespace std;

int main()
{

	setlocale(LC_ALL, "Rus");
	printf("Это программа которая считает cколько секунд в текущем году(в 100, в 1000 лет).\n\n");
	int a;
		unsigned int result, one_year;

	printf("Введите год: ");
	scanf_s("%d", &a);
    
	one_year = 31536000;

	result = a * one_year;
	printf("\nРезультат: %lu\n\n", result);
	printf("======================================================================\n");
	printf("======================================================================\n");
	printf("======================================================================\n\n");
}