#include "Fun.h"

void Bring(mon spis[], int spis_size)         /* функция для ввода с консоли*/
{

	for (int i = 0; i < N; i++) {
		system("cls");
		cout << "| Проект поиска внеземных сигналов №" << i + 1 << " |" << endl;
		cout << "|-------------------------------------|" << endl;
		cout << "Введите год -> ";
		cin >> spis[i].sc;                                      /*вводим в список [1].год */
		cout << "Введите имя научного руководителя -> ";
		cin >> spis[i].name;
		cout << "Введите диаметр антенны (м) -> ";
		cin >> spis[i].size;
		cout << "Введите рабочую частоту (МГц) -> ";
		cin >> spis[i].mhz;
	}
}

void byChance(mon spis[], int spis_size)         /*Рандомное заполнение структуры*/
{
	for (int i = 0; i < N; i++) {
		spis[i].sc = rand() % 200 + 1820;
		spis[i].name = "avtor_" + to_string(rand() % 50 + 100);
		spis[i].size = rand() % 1000 + 10;
		spis[i].mhz = rand() % 1000 + 10;
	}
}

void Print(mon spis[])
{
	system("cls");

		cout << "----------------------------------------------------------------------" << endl;
	cout << "|                  Проекты поиска внеземных сигналов                 |" << endl;
	cout << "|--------------------------------------------------------------------|" << endl;
	cout << "|Год |Научный              |Диаметр     |Рабочая частота             |" << endl;
	cout << "|    |руководитель         |антенны (м) |частота (МГц)               |" << endl;
	cout << "|----|---------------------|------------|----------------------------|" << endl;

	for (int i = 0; i < N; i++)
	{
		cout << "|" << setw(4) << spis[i].sc << "|" << setw(21) << left <<
			spis[i].name << setw(-21) << "|" << setw(12) << spis[i].size << "|" << setw(28) << spis[i].mhz << "|" << endl;
	}
	cout << "|--------------------------------------------------------------------|" << endl;
	cout << "|Примечание: наблюдались объекты от 2 звезд до нескольких галактик   |" << endl;
	cout << "----------------------------------------------------------------------" << endl;

		cout << "\nНажмите клавишу Enter для возврата в меню..." << endl;
	_getch();
	system("cls");


}

void Sort(mon spis[])                        /*Сортировка структуры*/
{
	mon temp;
	for (int i = 0; i < N - 1; i++) {
		for (int j = i; j < N; j++) {
			if (spis[i].sc > spis[j].sc) {
				temp = spis[i]; spis[i] = spis[j];
				spis[j] = temp;
			}
		}
	}
}