//поменять местами значение 2-х переменных. 1) Через дополнительную переменную. 2) Не использовать дополнительную перменную.
#include<iostream>
#include<stdio.h>

using namespace std;

int main()

{
	setlocale(LC_ALL, "Rus");
	printf("Задача:поменять местами значение 2-х переменных. 1) Через дополнительную переменную. 2) Не использовать дополнительную перменную.\n\n\n");
	printf("1) Через дополнительную переменную. \n\n");
	
	
	
	int a, b, c;
	char space;
	printf("Введите переменную а:");
	scanf_s("%d",&a);
	printf("Введите переменную b:");
	scanf_s("%d",&b);
	system("cls");
	
	printf("Переменная а=%d, b=%d.\n\n",a,b);

	c = a;
	a = b;
	b = c;

	
	printf("Результат: a=%d, b=%d\n\n",a,b);
	printf("-------------------------------------------------------------------------------------\n");
	printf("-------------------------------------------------------------------------------------\n");
	printf("-------------------------------------------------------------------------------------\n");
	printf("-------------------------------------------------------------------------------------\n\n");


	printf("2) Не использовать дополнительную перменную.\n\n");
	
	
	

	int x, y;
	
	setlocale(LC_ALL, "Rus");
	printf("Введите переменную x:");
	scanf_s("%d", &x);
	printf("Введите переменную y:");
	scanf_s("%d", &y);
	system("cls");
	printf("Переменная x=%d, y=%d.\n\n", x, y);
	
	x = x+y;
	y =y-x ;
	y =-y ;
	x = x - y;
	printf("Переменная x=%d, y=%d.\n\n", x, y);

	


}